{
    "categories": [
        {
            "title": "Text Conversion Tools",
            "details": "Convert, encode, and decode text effortlessly using tools designed for seamless data transformation and text manipulation.",
            "tools": [
                {
                    "name": "Add Prefix and Suffix",
                    "link": "/add-prefix-suffix",
                    "description": "Easily modify your text lines by adding custom prefixes and suffixes with our Prefix and Suffix Adder Tool. Input your text, specify the desired prefix and suffix, and watch as it instantly modifies each line according to your preferences. Perfect for formatting lists, coding snippets, or creating structured data. Empower your text editing tasks with this convenient tool, ensuring consistent formatting in various contexts.",
                    "contributors": [
                        {
                            "name": "Abdur Rehman Shaikh",
                            "githubId": "abdurrahmanshkh"
                        }
                    ]
                },
                {
                    "name": "ASCII Encoder & Decoder",
                    "link": "/ascii-encode-decode",
                    "description": "Dive into the fundamentals of digital text with our ASCII Encoder and Decoder Tool. Encode your text into ASCII, translating characters into numerical codes for digital representation. Input your content, and witness it transform into a series of digits, ideal for computer systems and data transmission. Alternatively, decode ASCII back into readable text effortlessly, bridging the gap between numeric codes and human-readable characters. Perfect for programmers, developers, and tech enthusiasts, our tool simplifies the encoding and decoding of ASCII characters, ensuring seamless integration into digital environments and data processing tasks.",
                    "contributors": [
                        {
                            "name": "Abdur Rehman Shaikh",
                            "githubId": "abdurrahmanshkh"
                        }
                    ]
                },
                {
                    "name": "Base64 Encoder & Decoder",
                    "link": "/base64-encode-decode",
                    "description": "Experience seamless data transformation with our Base64 Encoder and Decoder tool. Whether you need to encode sensitive information or decode encoded data, our user-friendly interface simplifies the process. Input your text or encoded string, and our tool swiftly converts it to Base64 format or decodes it back to its original form. Perfect for developers, security professionals, and anyone dealing with data manipulation tasks. Explore the efficiency of Base64 encoding and decoding effortlessly, ensuring secure communication and efficient data handling. Start encoding and decoding with ease, empowering your digital endeavors.",
                    "contributors": [
                        {
                            "name": "Abdur Rehman Shaikh",
                            "githubId": "abdurrahmanshkh"
                        }
                    ]
                },
                {
                    "name": "Binary Text Converter",
                    "link": "/binary-text-converter",
                    "description": "Transform text into a digital language or decode binary data with our Text to Binary and Binary to Text Converter Tool. Input your text, and instantly convert it into binary code, allowing seamless integration into digital systems or secure data transmission. Conversely, input binary digits, and watch them transform back into human-readable text. Ideal for programmers, cybersecurity professionals, and tech enthusiasts, our tool simplifies data conversion tasks. Whether you're working with computer protocols, coding messages, or decoding binary files, our converter ensures accuracy and efficiency. Start converting text to binary and vice versa with ease, bridging the gap between human language and digital communication.",
                    "contributors": [
                        {
                            "name": "Abdur Rehman Shaikh",
                            "githubId": "abdurrahmanshkh"
                        }
                    ]
                },
                {
                    "name": "Regex Tool",
                    "link": "/regex-tool",
                    "description": "The Regex tool is a powerful feature used for pattern matching within text. It allows users to define specific sequences of characters, known as regular expressions (regex), to identify, match, and manipulate strings based on complex patterns. This tool is highly versatile and is used in various applications such as Data Validation, Text Search, Data Extraction etc.",
                    "contributors": [
                        {
                            "name": "Soham Jayakar",
                            "githubId": "SohamJayakar"
                        },
                        {
                            "name": "Amey Patil",
                            "githubId": "Ameypatil07"
                        },
                        {
                            "name": "Mohmad Danish Rehman",
                            "githubId": "dannish110"
                        },
                        {
                            "name": "Darshana Jadhav",
                            "githubId": "Darshana1011"
                        },
                        {
                            "name": "Vijay Kalidas Pawar",
                            "githubId": "vijay-pawar-99"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "XML Formatter",
                    "link": "/xml-formatter",
                    "description": "A web-based tool for formatting XML content. Allows users to input XML code, format it with proper indentation, copy formatted XML, download it as a file, and clear the input/output areas. Built using HTML, CSS (Tailwind CSS), and JavaScript.",
                    "contributors": [
                        {
                            "name": "Masum Ahmed",
                            "githubId": "ri-masum"
                        },
                        {
                            "name": "Enamur Rabbi Ferdausi",
                            "githubId": "EnamurFerdausi"
                        },
                        {
                            "name": "Nikhil Sarve",
                            "githubId": "nikhilsarve"
                        },
                        {
                            "name": "Akash Gaikwad",
                            "githubId": "sky-gaikwad"
                        },
                        {
                            "name": "Atharva Thakur",
                            "githubId": "plantindesk"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "JSON Beautifier",
                    "link": "/json-beautifier",
                    "description": "JSON Beautifier help to auto format JSON and validate your JSON text. It also provides a tree view that helps to navigate your formatted JSON data.",
                    "contributors": [
                        {
                            "name": "Atharva Raut",
                            "githubId": "A7h4rv4"
                        },
                        {
                            "name": "Ayush Udayakumar Nair",
                            "githubId": "techgeekAyush"
                        },
                        {
                            "name": "Sarath Parayil",
                            "githubId": "sarathp22"
                        },
                        {
                            "name": "Shriya Prashant Ise",
                            "githubId": "shriya7ise"
                        },
                        {
                            "name": "Yusra Mukadam",
                            "githubId": "YusraMukadam"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Sql Converter",
                    "link": "/sql-converter",
                    "description": "Converts .sql into csv, xlsx and more",
                    "contributors": [
                        {
                            "name": "Somesh Diwan",
                            "githubId": "Someshdiwan"
                        },
                        {
                            "name": "Suryank Chavan",
                            "githubId": "suryank05"
                        },
                        {
                            "name": "Akankshasarade",
                            "githubId": "Akankshasarade"
                        },
                        {
                            "name": "Shristi Kushwaha",
                            "githubId": "Shri6apr"
                        },
                        {
                            "name": "Aditya Gupta",
                            "githubId": "AdityaGupta"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Image and Graphic Tools",
            "details": "Create, edit, and transform images or graphics with innovative tools to boost your creativity and productivity.",
            "tools": [
                {
                    "name": "App Store Screenshort Generator",
                    "link": "/app-store-screenshot-generator",
                    "description": "Our tool makes creating professional app store screenshots easy and efficient. With powerful features, device support, and customization options, it helps you showcase your app beautifully. Enhance your app's visual appeal and make a lasting impression.",
                    "contributors": [
                        {
                            "name": "Nilambari Mahajan",
                            "githubId": "Nilambari-Mahajan"
                        },
                        {
                            "name": "Vaibhav Dingalwar",
                            "githubId": "irrereplacable26"
                        },
                        {
                            "name": "",
                            "githubId": ""
                        },
                        {
                            "name": "",
                            "githubId": ""
                        },
                        {
                            "name": "",
                            "githubId": ""
                        }
                    ]
                },
                {
                    "name": "Camera Filters",
                    "link": "/camera-filters",
                    "description": "This project is a Svelte-based live camera filter application. It captures a video stream from your device's camera and applies real-time filters using a canvas element. The application includes filters like grayscale, sepia, blur, brightness, and more. Users can select filters from a dropdown menu to see their effects instantly. The video feed is processed and displayed on the canvas with the chosen filter applied. This setup provides an interactive way to experiment with live camera filters.",
                    "contributors": [
                        {
                            "name": "Shubham Pawade",
                            "githubId": "ShubhamSPawde"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Gradient Generator",
                    "link": "/gradient-generator",
                    "description": "The Gradient Generator is a tool for Developers which allows you to create Gradient between 2 Colors and Copy its CSS Output.",
                    "contributors": [
                        {
                            "name": "Yash Mankar",
                            "githubId": "AraeneaCLI"
                        }
                    ]
                },
                {
                    "name": "Image Base64 Decode",
                    "link": "/image-base64-decode",
                    "description": "The Image Base64 Decode tool offers developers an efficient way to decode Base64-encoded image data back into image files. This tool accepts Base64-encoded strings and converts them into their corresponding image file formats, enabling developers to handle and manipulate image data seamlessly. Simplify your image data processing workflow with this tool and ensure efficient utilization of Base64-encoded images in your applications.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Image Base64 Encode",
                    "link": "/image-base64-encode",
                    "description": "The Image Base64 Encode tool enables developers to convert image files into Base64-encoded strings effortlessly. By simply uploading an image file, this tool converts the image into a Base64-encoded representation, which can be easily integrated into HTML, CSS, or JavaScript code. Integrate this tool into your development workflow to efficiently handle image data and optimize its usage in various web applications.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Image Color Picker",
                    "link": "/image-color-picker",
                    "description": "The Image Color Picker is a versatile tool that allows developers to extract color information from images effortlessly. With a simple interface, you can upload an image and identify specific colors by selecting points on the image. The tool provides the corresponding color codes (e.g., HEX, RGB, HSL) for easy integration into your projects. Streamline your color selection process and enhance your application's visual appeal with this efficient color picker.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Image Editor",
                    "link": "/image-editor",
                    "description": "This tool that allows images to be edited and also converted to different graphics formats.",
                    "contributors": [
                        {
                            "name": "Harshith",
                            "githubId": "harshith1019"
                        },
                        {
                            "name": "Yedulla Nandavardhan Reddy",
                            "githubId": "Nandavardhan1405"
                        },
                        {
                            "name": "Chaitanya Reddy Gujjula",
                            "githubId": "chaitugujjula00"
                        },
                        {
                            "name": "Aimaan Qureshi",
                            "githubId": "19aimann"
                        },
                        {
                            "name": "Subitha",
                            "githubId": "Subitha12"
                        },
                        {
                            "name": "AjayRaj",
                            "githubId": "ajayrajrthd"
                        },
                        {
                            "name": "Sanjana",
                            "githubId": "sanjanamutkiri"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Image Text Extractor",
                    "link": "/image-text-extractor",
                    "description": "Unlock the textual content hidden within images with our Image Text Extractor. Utilizing advanced optical character recognition (OCR) technology, our tool effortlessly extracts text from images, making printed or handwritten content accessible and editable. Simply upload your image, and watch as the tool accurately identifies and converts text into digital format. Ideal for digitizing documents, extracting quotes, or enhancing accessibility, our Image Text Extractor simplifies the process of converting visual information into editable text. Empower your data extraction tasks with our efficient and precise tool, ensuring valuable textual content is readily available for your digital endeavors.",
                    "contributors": [
                        {
                            "name": "Pratik Vinayak More",
                            "githubId": "Comder101"
                        }
                    ]
                },
                {
                    "name": "Living Background Generator",
                    "link": "/living-background-generator",
                    "description": "The Living Background Generator is a tool that allows developers to select the colour of their choice along with the type of gradient of their choice. The tool then outputs the style code for the user customized background in the output window.  This tool allows the user to create the animated background visually allowing the user to visualize it better than the oldie way.",
                    "contributors": [
                        {
                            "name": "RIYA KUSHWAHA",
                            "githubId": "RIYA1001"
                        },
                        {
                            "name": "Rajan Pusalkar",
                            "githubId": "Rajan232"
                        }
                    ]
                },
                {
                    "name": "Neumorphism Generator",
                    "link": "/neumorphism-generator",
                    "description": "The Neumorphism Generator is a powerful tool designed for developers and designers to easily create neumorphic user interfaces. With this toolkit, you can effortlessly generate neumorphic design elements, such as buttons, cards, and input fields, by simply adjusting various parameters and styles. Enhance your applications with this intuitive tool and create visually stunning and modern user interfaces with ease.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        },
                        {
                            "name": "Abhishek Jadhav",
                            "githubId": "AbhishekJadhav2002"
                        },
                        {
                            "name": "Vikas Kushwaha",
                            "githubId": "Vikas350"
                        }
                    ]
                },
                {
                    "name": "SVG Path Visualizer",
                    "link": "/svg-path-visualizer",
                    "description": "The SVG Path Visualizer is a powerful tool designed to simplify the visualization and debugging of SVG path data. By inputting your SVG path code, this tool provides an immediate graphical representation of the path, allowing developers and designers to see real-time changes as they edit the path data. This tool helps in understanding complex path commands, optimizing SVG graphics, and ensuring precise design adjustments. Enhance your workflow with the SVG Path Visualizer, making it easier to create and refine scalable vector graphics with accuracy and efficiency.",
                    "contributors": [
                        {
                            "name": "Abdur Rehman Shaikh",
                            "githubId": "abdurrahmanshkh"
                        },
                        {
                            "name": "Mansi Karki",
                            "githubId": "MansiKarki"
                        },
                        {
                            "name": "Priyanka Kadam",
                            "githubId": "Priyanka-Kadam427"
                        },
                        {
                            "name": "Sania Joseph",
                            "githubId": "sania-joe"
                        },
                        {
                            "name": "Yathang Tupe",
                            "githubId": "Yathang007"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "SVG Pattern Generator",
                    "link": "/svg-pattern-generator",
                    "description": "The SVG Pattern Generator is a free tool that creates customizable SVG background patterns. It offers various settings and shapes, with adjustable size, spacing, rotation, skew, and opacity. Patterns can be exported as SVG or PNG files, used anywhere, including in website code. They can also serve as templates for social media assets. Patterns can be exported as repeating backgrounds for website optimization. However, rotation and skew parameters must be set manually if required.",
                    "contributors": [
                        {
                            "name": "Nikhil sai Sripathi",
                            "githubId": "NikhilsaiSripathi"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        },
                        {
                            "name": "Dhanalakshmi C",
                            "githubId": "poojagowda00"
                        }
                    ]
                },
                {
                    "name": "Virtual Graph Paper",
                    "link": "/virtual-graph-paper",
                    "description": "Virtual Graph Paper is a tool for creating drawings and illustrations on a virtual grid.",
                    "contributors": [
                        {
                            "name": "Abhishek Rajput",
                            "githubId": "Abhishek-2502"
                        },
                        {
                            "name": "Darshana Jadhav",
                            "githubId": "Darshana1011"
                        },
                        {
                            "name": "Nikhil Shukla",
                            "githubId": "Nikhil-shukla1"
                        },
                        {
                            "name": "Suzanne Sunil Nazareth",
                            "githubId": "suzannenazareth"
                        },
                        {
                            "name": "Yash Jain",
                            "githubId": "YashJain999"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Content Generation and Design Tools",
            "details": "Generate high-quality content, layouts, and designs using intuitive tools tailored for professional and creative needs.",
            "tools": [
                {
                    "name": "Advice Generator",
                    "link": "/advice-generator",
                    "description": "The Advice Generator is a valuable tool that provides developers with inspirational and practical advice to overcome challenges and improve their work. By generating random advice snippets, this tool helps developers find guidance and inspiration. Access a wealth of advice easily with this tool and elevate your mindset.",
                    "contributors": [
                        {
                            "name": "Rifat Perween",
                            "githubId": "rifatperween"
                        }
                    ]
                },
                {
                    "name": "Business Card Generator",
                    "link": "/business-card-generator",
                    "description": "Create professional and personalized business cards effortlessly with our intuitive Business Card Generator. Design your cards with a variety of templates, fonts, and colors to suit your brand. Easily customize your details and download your ready-to-print business cards in minutes.",
                    "contributors": [
                        {
                            "name": "Kaushal Patel",
                            "githubId": "kaushalkp-12"
                        },
                        {
                            "name": "Yash Patel",
                            "githubId": "Yash312002"
                        },
                        {
                            "name": "Emmanuel Baraka",
                            "githubId": "Theemanu24"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Document Generator",
                    "link": "/document-generator",
                    "description": "Document generator enables users to create dynamic documents with headers , paragraphs and images .Users can customize text (font size, family , boldness , alignment) and highlight headers . Export option includes PDF and DOC formats using jsPDF and docx , with file-saver for downloads",
                    "contributors": [
                        {
                            "name": "Karan Rajkumar Jain",
                            "githubId": "karanjain09"
                        },
                        {
                            "name": "Asmita Agre",
                            "githubId": "Asmitaagre46"
                        },
                        {
                            "name": "Maimuna Khatoon",
                            "githubId": "maimuna01"
                        },
                        {
                            "name": "Vankadari Naga Pallavi",
                            "githubId": "Pallavi287"
                        },
                        {
                            "name": "Rajendra Kumar ",
                            "githubId": "rajendrakumar360"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Lorem Ipsum Generator",
                    "link": "/lorem-ipsum-generator",
                    "description": "Effortlessly generate placeholder text with our Lorem Ipsum Generator. Specify the number of characters required, and instantly receive Lorem Ipsum text tailored to your needs. Ideal for designers, developers, and content creators seeking filler text for projects. Enjoy seamless integration into your layouts, ensuring accurate content spacing and visual appeal. Simplify your creative process with our straightforward Lorem Ipsum Generator, allowing you to focus on design without worrying about text content.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Password Generator",
                    "link": "/password-generator",
                    "description": "The Password Generator is a reliable and secure tool that enables developers to easily generate strong and unique passwords for their applications. With customizable options, such as password length, character types (uppercase, lowercase, numbers, symbols), and exclusion of ambiguous characters, this tool ensures the creation of robust passwords that meet the highest security standards. Simplify the process of password generation and strengthen the security of your applications with this convenient tool.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Random Data Generator",
                    "link": "/random-data-generator",
                    "description": "The Random Data Generator is a tool which generates fake/dummy dataset that can be used for testing.",
                    "contributors": [
                        {
                            "name": "Harshit Lakshakar",
                            "githubId": "Hst-13"
                        },
                        {
                            "name": "Shantanu Badgujar",
                            "githubId": "Shantanuz06"
                        }
                    ]
                },
                {
                    "name": "Word Cloud Generator",
                    "link": "/wordcloud-generator",
                    "description": "The Word Cloud Generator is a dynamic tool that transforms your text into a visually appealing word cloud. By entering your desired words, you can instantly create a colorful and randomized cloud of words, where the size of each word reflects its frequency or significance. Perfect for visualizing text data, highlighting key terms, or adding a creative touch to your presentations, the Word Cloud Generator makes it easy to see the bigger picture in your words. Simply input your text, and watch your words come to life!",
                    "contributors": [
                        {
                            "name": "Joel Mathew Job",
                            "githubId": "JoelMathewJob"
                        },
                        {
                            "name": "Tanya Jain",
                            "githubId": "tanya050803"
                        },
                        {
                            "name": "Anushka Pandey",
                            "githubId": "AnushkaPandey0415"
                        },
                        {
                            "name": "Malay Chowdhury",
                            "githubId": "malayit23"
                        },
                        {
                            "name": "Vaishnavi Mhamunkar",
                            "githubId": "vaish-18"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Development and Testing Tools",
            "details": "Optimize your development workflow with tools for coding, debugging, and responsive design testing.",
            "tools": [
                {
                    "name": "Online API Tool",
                    "link": "/api-tool",
                    "description": "Our Online API Tool is a versatile and user-friendly platform designed to simplify the process of working with APIs. Just like Postman, it provides developers and teams with powerful features for testing, documenting, and managing APIs. Whether you're building, testing, or monitoring APIs, our tool offers a comprehensive suite of tools to streamline your workflow. With an intuitive interface, collaboration features, and extensive customization options, it's the ideal choice for any development project. Elevate your API development and management experience with our Online API Tool and unlock the full potential of your APIs.",
                    "contributors": [
                        {
                            "name": "A. Amrutha Sri",
                            "githubId": "AmruthaSri852"
                        },
                        {
                            "name": "Nandini Gite",
                            "githubId": "NandiniGite"
                        }
                    ]
                },
                {
                    "name": "Code Linter",
                    "link": "/code-linter",
                    "description": "A code linter is a software tool that analyzes source code to detect and report on programming errors, bugs, stylistic inconsistencies, and suspicious patterns. It helps developers ensure their code adheres to coding standards, best practices, and predefined rules specific to the programming language or project requirements. Code linters are essential in improving code quality, maintaining consistency across development teams, and preventing common coding mistakes before they become problematic in software development projects. They often provide feedback in the form of warnings or errors directly within integrated development environments (IDEs) or through command-line interfaces, aiding developers in writing cleaner, more reliable code.",
                    "contributors": [
                        {
                            "name": "Abhirup Mukherjee",
                            "githubId": "Abhirup2004-p"
                        },
                        {
                            "name": "Aryan Nimbalkar",
                            "githubId": "Aryan200324"
                        },
                        {
                            "name": "Atufa Akhtar",
                            "githubId": "atufaakhtar"
                        },
                        {
                            "name": "Swakshar Bora",
                            "githubId": "DastardlyKat"
                        },
                        {
                            "name": "Tanvi Panchal",
                            "githubId": "Tanvi54"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "CSS Animator",
                    "link": "/css-animator",
                    "description": "The CSS Animator is a powerful tool that simplifies the creation of engaging and interactive CSS animations for developers. With an intuitive interface, you can generate CSS animations by defining keyframes, durations, delays, and easing functions. This tool eliminates the need for manual coding and enables developers to bring their designs to life with captivating CSS animations easily.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        },
                        {
                            "name": "Munsif Satopay",
                            "githubId": "munsifsatopay"
                        }
                    ]
                },
                {
                    "name": "Responsive Design Tester",
                    "link": "/responsive-design-tester",
                    "description": "This app is designed to help users see how their web pages look on different devices by previewing URLs in various screen resolutions. With a sidebar for quick access to mobile, desktop, and tablet options, it offers a straightforward way to switch between device views. Simply input a URL, choose a device, and watch the app adjust to show the selected screen size. Featuring a sticky URL input area and smooth scrolling, this tool enhances the user experience by making responsive design testing seamless and efficient.",
                    "contributors": [
                        {
                            "name": "David Kwasi Mensah Akyer",
                            "githubId": "dkmakyer"
                        },
                        {
                            "name": "Tasnim Munawar Rafee",
                            "githubId": "Rafee104104"
                        },
                        {
                            "name": "Sahil Navale",
                            "githubId": "sahiln15"
                        },
                        {
                            "name": "Amila Jayamaha",
                            "githubId": "AmilaJayamaha"
                        },
                        {
                            "name": "Aditi More",
                            "githubId": "8897adira"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Robots.txt Generator",
                    "link": "/robots-txt-generator",
                    "description": "The Robots.txt Generator is a must-have tool for developers to create the robots.txt file, which controls search engine crawlers' access to specific pages or directories on a website. This tool offers a user-friendly interface to define crawling rules, including allow and disallow directives, to ensure optimal search engine indexing and prevent unwanted content from being indexed. Create and customize your robots.txt file efficiently with this generator to enhance your website's search engine optimization (SEO) efforts.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "SQL Query Builder",
                    "link": "/sql-query-builder",
                    "description": "The SQL Query Generator is a powerful tool designed for users to create complex SQL queries effortlessly. It offers a user-friendly interface for selecting tables and columns, applying joins, filters, sorting, and grouping. The tool dynamically generates and displays the SQL query in real-time, simplifying database query creation without needing extensive SQL knowledge. Enhance your data management tasks with this intuitive and efficient query builder.",
                    "contributors": [
                        {
                            "name": "Atharva Sawant",
                            "githubId": "Satharva2004"
                        },
                        {
                            "name": "Kalyan Sharma",
                            "githubId": "kalyan123s"
                        },
                        {
                            "name": "Harshita S",
                            "githubId": "Harshitha0066"
                        },
                        {
                            "name": "Garret Farnandez",
                            "githubId": "garretfernandezz"
                        },
                        {
                            "name": "Moain Khan",
                            "githubId": "Moainkhan"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Media Editing and Management Tools",
            "details": "Manage and edit audio, video, and GIFs with tools designed for enhancing media quality and experience.",
            "tools": [
                {
                    "name": "GIF-Toolkit",
                    "link": "/gif-toolkit",
                    "description": "A GIF toolkit comprises a diverse range of software tools tailored for creating, editing, optimizing, and manipulating GIF (Graphics Interchange Format) images. These toolkits enable users to generate GIFs from images, videos, or sequences of frames, adjusting aspects like frame rate, resolution, and applying effects. They facilitate editing tasks such as cropping, resizing, adding text, stickers, and annotations. Optimization features ensure GIFs maintain quality while reducing file sizes through techniques like color reduction and frame rate adjustment. These toolkits often support conversion to and from other formats, integrate special effects for creative enhancements, provide batch processing for efficiency, and offer export options suited for various digital platforms and sharing methods. GIF toolkits are indispensable for designers, marketers, content creators, and anyone involved in extensive work with animated images in digital media.",
                    "contributors": [
                        {
                            "name": "Arya Bacchuwar",
                            "githubId": "Devil-panda"
                        },
                        {
                            "name": "Mukesh Madipelly",
                            "githubId": "mukeshmadipelly"
                        },
                        {
                            "name": "Satvik Pandey",
                            "githubId": "worldisconfusion"
                        },
                        {
                            "name": "Shruti Johnson",
                            "githubId": "SHRUTIJOHNSON"
                        },
                        {
                            "name": "Dinesh D",
                            "githubId": "dinesh-dh"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Screen Video Recorder",
                    "link": "/screen-video-recorder",
                    "description": "The Screen Video Recorder is a handy tool designed for developers to capture and record high-quality videos of their screen activities. Whether you need to create software demos, tutorial videos, or bug reports, this tool provides a user-friendly interface to record your screen with customizable options, including video resolution, audio settings, and capture area selection. Enhance your documentation and communication efforts by easily recording and sharing your screen activities.",
                    "contributors": [
                        {
                            "name": "Rifat Perween",
                            "githubId": "rifatperween"
                        },
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Voice-Recorder-and-Editor",
                    "link": "/voice-recorder-and-editor",
                    "description": "Voice-Recorder-and-Editor",
                    "contributors": [
                        {
                            "name": "Radha Rungta",
                            "githubId": "Radha Rungta"
                        },
                        {
                            "name": "JatinnSihag",
                            "githubId": "jatinsihag234"
                        },
                        {
                            "name": "Olive Daniel",
                            "githubId": "OliveDaniel24"
                        },
                        {
                            "name": "Naman Wadhawan",
                            "githubId": "NamanWadhawan"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Time and Productivity Tools",
            "details": "Boost your productivity and time management with tools designed to organize tasks, track time, and stay focused.",
            "tools": [
                {
                    "name": "Multi-timer",
                    "link": "/multi-timer",
                    "description": "Multi Timer with alarm mechanism",
                    "contributors": [
                        {
                            "name": "Prajwal Dilip Ganar",
                            "githubId": "Prajwal435"
                        },
                        {
                            "name": "Akanksha Kumbhar",
                            "githubId": "Akanksha0830"
                        },
                        {
                            "name": "Yash Mehetre",
                            "githubId": "YashMehetre"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Flashcard Generator",
                    "link": "/online-flashcard",
                    "description": "A versatile tool for creating and managing custom flashcards. Easily add text, images, and descriptions to each card. Perfect for studying, teaching, or memorization.",
                    "contributors": [
                        {
                            "name": "Linga Reddy Gari Kavyanjali",
                            "githubId": "Kavyanjali02"
                        },
                        {
                            "name": "Umeed Mujawar",
                            "githubId": "Umed24"
                        },
                        {
                            "name": "Prem Verma",
                            "githubId": "vermaprem1012"
                        },
                        {
                            "name": "Sunidhi Munshi",
                            "githubId": "Sunidhimu"
                        },
                        {
                            "name": "Laxmi Khilnani",
                            "githubId": "laxmikhilnani20"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Pomodoro",
                    "link": "/pomodoro",
                    "description": "The Pomodoro tool is a productivity-enhancing feature designed specifically for developers. Based on the popular Pomodoro Technique, this tool helps you manage your time effectively by breaking your work into focused intervals, typically 25 minutes long, followed by short breaks. This systematic approach aids in maintaining concentration, combating procrastination, and boosting productivity. Integrate this tool into your workflow to optimize your work habits and accomplish tasks more efficiently.",
                    "contributors": [
                        {
                            "name": "Rifat Perween",
                            "githubId": "rifatperween"
                        }
                    ]
                },
                {
                    "name": "Sticky Notes",
                    "link": "/sticky-notes",
                    "description": "Develop a Sticky Notes app featuring quick note-saving, an appealing to-do list, and reminder settings. Users can pin important notes for easy access with highlighting on the screen, while timestamps show the last update time for each note, aiding in organization.",
                    "contributors": [
                        {
                            "name": "Saket Prabhakar",
                            "githubId": "sabotagefrenzy"
                        },
                        {
                            "name": "Raj Patkar",
                            "githubId": "Raj-Patkar"
                        },
                        {
                            "name": "Chhaya Sharma",
                            "githubId": "ChhayaSharma21"
                        },
                        {
                            "name": "Pranjali Jibhakate",
                            "githubId": "Pranjali2410"
                        },
                        {
                            "name": "Tanuja Yadav",
                            "githubId": "tanuja1922"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Interactive and Educational Tools",
            "details": "Engage and educate with tools that create quizzes, polls, puzzles, and mindmaps for interactive learning and collaboration.",
            "tools": [
                {
                    "name": "Online live Quiz",
                    "link": "/online-live-quiz",
                    "description": "A quiz app where users create and share quizzes via links, with timed sessions, question display, real-time answers, and choices, and ending with a complete result summary shown as a bar graph.",
                    "contributors": [
                        {
                            "name": "AdityaPratap Singh",
                            "githubId": "Aditya-Tomer"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Online Poll Tool",
                    "link": "/online-poll-tool",
                    "description": "The Online Poll Tool simplifies the creation and management of polls, enabling users to gather feedback and insights effortlessly. It offers customizable options for poll types, answer options, and result analysis, ensuring a user-friendly experience for both creators and respondents.",
                    "contributors": [
                        {
                            "name": "Onkar Mendhapurkar",
                            "githubId": "onkar69483"
                        },
                        {
                            "name": "Bharath Sagam",
                            "githubId": "bharathsagam"
                        },
                        {
                            "name": "Prachi Patil",
                            "githubId": "prachi5791"
                        },
                        {
                            "name": "Piyush Nimbalkar",
                            "githubId": "piyush1519"
                        },
                        {
                            "name": "Atharva Jadhav",
                            "githubId": "atharva445"
                        },
                        {
                            "name": "Priyanka Gupta",
                            "githubId": "priyankag12"
                        },
                        {
                            "name": "Sarthak Chaudhari",
                            "githubId": "sarthak0205"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Puzzle Maker",
                    "link": "/puzzle-maker",
                    "description": "Introducing the Ultimate Puzzle Maker! Dive into the world of wordplay with our versatile tool, designed to craft engaging crosswords, thrilling word searches, and exciting Wheel of Fortune puzzles. Whether you're a seasoned puzzle enthusiast or a casual solver, our Puzzle Maker offers a seamless and enjoyable experience, perfect for honing your vocabulary and problem-solving skills. Unleash your creativity and challenge yourself or others with our customizable and fun puzzle options!",
                    "contributors": [
                        {
                            "name": "Mihir Joshi",
                            "githubId": "mihirjoshi26"
                        },
                        {
                            "name": "Dharmik Satani",
                            "githubId": "DBSatani88"
                        },
                        {
                            "name": "Sonal Sonarghare",
                            "githubId": "SonalSonarghare"
                        },
                        {
                            "name": "Sourabh Singh",
                            "githubId": "SourabhSinghBhadouriya"
                        },
                        {
                            "name": "Tanvi More",
                            "githubId": "Tanvi119"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Virtual Mindmap Maker",
                    "link": "/virtual-mindmap",
                    "description": "Curate personalised mindmaps to ease your learning with effective visuals. This tool will help you in making mindmaps to store information as linked cards for easier memorisation. ",
                    "contributors": [
                        {
                            "name": "Snehal Shetye",
                            "githubId": "Snehalshetye18"
                        },
                        {
                            "name": "Purvi Passi",
                            "githubId": "pxxpassi"
                        },
                        {
                            "name": "Cheryl Lobo",
                            "githubId": "cherylobo"
                        },
                        {
                            "name": "Prachi Zodage",
                            "githubId": "PrachiZodage"
                        },
                        {
                            "name": "Aanchal Mehta",
                            "githubId": "Aanchal1902"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Data and File Handling Tools",
            "details": "Streamline file conversions, data management, and handling processes with comprehensive tools.",
            "tools": [
                {
                    "name": "File Converter",
                    "link": "/file-converter",
                    "description": "A file converter is a online tool that allows users to convert files from one format to another. It simplifies the process of converting files between different formats including images, audio, and video, making it an essential tool for professionals, students, and anyone dealing with various types of digital media.",
                    "contributors": [
                        {
                            "name": "Mohammad Adil",
                            "githubId": "devilzs1"
                        }
                    ]
                },
                {
                    "name": "Random Image Generator",
                    "link": "/random-image-generator",
                    "description": "The Random Image Generator is a dynamic tool that enables developers to generate random images on the fly. Whether you need placeholder images for testing or want to add visual elements to your applications, this tool can generate a wide variety of random images based on different categories, dimensions, and styles. Utilize this tool to add visual appeal and realism to your applications effortlessly.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "Watermark PDF",
                    "link": "/watermark-pdf",
                    "description": "Add Text or Image as a watermark to the PDF document",
                    "contributors": []
                }
            ]
        },
        {
            "title": "Financial Calculators",
            "details": "Accurately compute financial metrics, payouts, and balances with tools designed for personal and professional financial planning.",
            "tools": [
                {
                    "name": "Annuity Payout Calculator",
                    "link": "/annuity-payout-calculator",
                    "description": "This calculator can estimate the annuity payout amount for a fixed payout length or estimate the length that an annuity can last if supplied a fixed payout amount. Please use our Annuity Calculator to estimate the end balance of an annuity for the accumulation phase.",
                    "contributors": [
                        {
                            "name": "Sumit Mishra",
                            "githubId": "Sumitm6879"
                        }
                    ]
                }
            ]
        },
        {
            "title": "Specialized Utility Tools",
            "details": "Access unique tools for niche functionalities and specific user needs in various domains.",
            "tools": [
                {
                    "name": "Crypto Address Validation",
                    "link": "/crypto-address-validation",
                    "description": "Crypto Address Validator is a tool that validates addresses for multiple cryptocurrencies. It ensures the correctness of Bitcoin, Ethereum, Litecoin, Ripple, Bitcoin Cash, Cardano, Polkadot, and Dogecoin addresses. A must-have for secure crypto transactions.",
                    "contributors": [
                        {
                            "name": "Tilakshankar Sakthikumar",
                            "githubId": "tilakshankar"
                        },
                        {
                            "name": "Ketaki Vatturkar",
                            "githubId": "ketakivatturkar"
                        },
                        {
                            "name": "Nikhil Singh",
                            "githubId": "nikkhil28-29"
                        },
                        {
                            "name": "Mayur Nikam",
                            "githubId": "MayurNikam989"
                        },
                        {
                            "name": "Mathew Jacob",
                            "githubId": "mathewjacob123"
                        },
                        {
                            "name": "Tanish Chopra",
                            "githubId": "TanishC28"
                        },
                        {
                            "name": "Sanjukta Sarkar",
                            "githubId": "Crystalite0201"
                        },
                        {
                            "name": "Pragya",
                            "githubId": "Pragya930"
                        },
                        {
                            "name": "Ashwani Kumar Singh",
                            "githubId": "ashwani2529"
                        }
                    ]
                },
                {
                    "name": "Device Details",
                    "link": "/device-details",
                    "description": "The Device Details tool provides developers with essential information about user devices, including browser specifications, screen resolution, operating system details, and more. By integrating this tool into your applications, you can gather valuable insights about your users' devices, allowing you to optimize user experiences, ensure compatibility, and tailor your content or features accordingly.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                },
                {
                    "name": "WhatsApp Link Generator",
                    "link": "/whatsapp-api-generator",
                    "description": "The WhatsApp Link Generator is a specialized tool that simplifies the process of generating API integration code for the WhatsApp Me feature. With this tool, developers can quickly create the necessary code snippets to enable users to initiate conversations with a specific phone number on WhatsApp. This generator streamlines the integration of the WhatsApp Me functionality into your applications, allowing users to reach out and engage with your business or service effortlessly. Enhance user communication and engagement by utilizing this powerful API generator for WhatsApp integration.",
                    "contributors": [
                        {
                            "name": "Hannan Satopay",
                            "githubId": "hannansatopay"
                        }
                    ]
                }
            ]
        }
    ]
}